---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintAngleFromFixedDir
source: html/2127d908-98c0-598f-3fb3-7a9621e052f6.htm
---
# RebarShapeConstraintAngleFromFixedDir Members

Create an angular constraint.